Repository: villepekkaa/spotprice-plasma
Catalog: translations/*.po
Languages: fi

source: Today
fi: Tänään

source: Now
fi: Nyt

source: Tomorrow
fi: Huomenna

source: Tomorrow's prices available around 14:15
fi: Huomisen hinnat saatavilla noin klo 14:15

source: Settings
fi: Asetukset

source: General
fi: Yleiset

source: Price Thresholds (c/kWh)
fi: Hintarajat (c/kWh)

source: Green threshold:
fi: Vihreä raja:

source: Yellow threshold:
fi: Keltainen raja:

source: Red threshold:
fi: Punainen raja:

source: Price Margin
fi: Hintamarginaali

source: Margin (c/kWh):
fi: Marginaali (c/kWh):

source: This margin is added to all displayed prices
fi: Tämä marginaali lisätään kaikkiin näytettäviin hintoihin

source: Transfer Fee
fi: Siirtohinta

source: Transfer fee (c/kWh):
fi: Siirtohinta (c/kWh):

source: This transfer fee is added to all displayed prices
fi: Tämä siirtohinta lisätään kaikkiin näytettäviin hintoihin

source: Cheapest
fi: Halvin

source: Most expensive
fi: Kallein

source: Average 7-23
fi: Keskihinta 7-23

source: Average 24h
fi: Keskihinta 24h

source: Last update %1
fi: Viimeisin päivitys %1

source: Next update %1
fi: Seuraava päivitys %1

source: Update failed (%1), using cached prices
fi: Päivitys epäonnistui (%1), käytetään välimuistia

source: Current price
fi: Nykyinen hinta

source: Price
fi: Hinta

source: Now %1 - %2
fi: Nyt %1 - %2
